doc.org
#+TITLE: Scripts for Managing fMRI Data
#+AUTHOR: Caitlin Carey, Stephanie McMains, Alex Storer
#+EMAIL: smcmains@fas.harvard.edu
#+DATE: May, 2012


#+PROPERTY: exports both
#+PROPERTY: results output
#+PROPERTY: cache no
#+PROPERTY: html-postamble "<div id=\"show_source\"><input type=\"button\" value=\"Show Org source\" onClick='show_org_source()'></div><div id=\"license\"><p>Documentation from the http://orgmode.org/worg/ website (either in its HTML format or in its Org format) is licensed under the <a href=\"http://www.gnu.org/copyleft/fdl.html\">GNU Free Documentation License version 1.3</a> or later.  The code examples and css stylesheets are licensed under the <a href=\"http://www.gnu.org/licenses/gpl.html\">GNU General Public License v3</a> or later.</p></div>"
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t TeX:t LaTeX:nil skip:nil d:t tags:not-in-toc creator:nil
#+STYLE:    <link rel="stylesheet" type="text/css" href="sty.css" />


* setup								   :noexport:

#+begin_src emacs-lisp :cache no
  (setq org-export-html-postamble "Harvard is super. <a
  href=\"mailto:foo@bar.baz\">E-mail</a> for help.")
#+end_src

#+results[3b14f99fc068c3b2056f3fc1e1b5fdfab8b56322]:
: Harvard is super. <a
: href="mailto:foo@bar.baz">E-mail</a> for help.

* Goals
This document describes the suite of scripts written to help you
interact with ~cbsget~ and ~spm~.

** Prerequisites
All scripts require that you be on the cluster, and were tested using
Matlab 2011a.  (Use with other versions is unsupported, and is known
to fail using Matlab 2007)

** Summary

The following scripts have been written

| Script Name           | Location        | Details                                                     |
|-----------------------+-----------------+-------------------------------------------------------------|
| ~getsubject.m~        | ~/path/to/file~ | Pulls data using ~cbsget~ and creates a directory structure |
| ~does not exist~      | lkj             | lkj                                                         |
| ~still doesn't exist~ | klj             | iwoe                                                        |
|                       |                 |                                                             |

* ~getsubject.m~

~getsubject.m~ is a script that pulls data from the central
repository, and creates a directory structure for it.  ~getsubject~
may be called from within Matlab or from the command line.  It takes
the following inputs:

~GETSUBJECT(subjectid, boldruns, structrun, fmruns, destpath)~
|-------------+---------------------------------------|
| Input       | Description                           |
|-------------+---------------------------------------|
| /           | <>                                    |
| ~subjectid~ | the name of the subject, as as string |
|-------------+---------------------------------------|
| ~boldruns~  | a vector of the BOLD runs             |
|-------------+---------------------------------------|
| ~structrun~ | a vector of the single struct-run     |
|-------------+---------------------------------------|
| ~fmruns~    | a vector of the field-mapping runs    |
|-------------+---------------------------------------|
| ~destpath~  | the location to place the output      |
|-------------+---------------------------------------|

For example:
#+begin_example
getsubject('120418_spmtest',[5],[4],[6 7],'/tmp')
#+end_example

This creates the following directory tree:
#+begin_example
   |-tmp   
   |---120418_spmtest
   |-----RAW
   |-----analysis
   |-----batch
   |-----preprocessed
#+end_example

Within the ~RAW~ directory is a tarball (~[subjectname].tar.gz~)
containing the DICOMs in a compressed format.  ~spm~ has also been
used to convert the files from ~.dcm~ format to ~.img~ and ~.hdr~
formats in the ~preprocessed~ directory.

The files have also been renamed.  Because they are already in the
subject directory, they have been stripped of their subjectid, and are
renamed as follows:

|-------------------------+---------------------------------------------|
| File name               | Description                                 |
|-------------------------+---------------------------------------------|
| /                       | <>                                          |
| ~f-run001-006.img~      | Image 6 of the first BOLD run               |
|-------------------------+---------------------------------------------|
| ~s-struct.img~          | The structural image for the subject        |
|-------------------------+---------------------------------------------|
| ~s-fieldmap-mag-01.img~ | The magnitude of the fieldmap (if provided) |
|-------------------------+---------------------------------------------|
| ~s-fieldmap_phase.img~  | The phase of the fieldmap                   |
|-------------------------+---------------------------------------------|


* Acknowledgments
These scripts were written by Alex Storer, Caitlin Carey and Stephanie
McMains with additional assistance from David Dodell-Feder.
